papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/beamInCrossFlow.Richter2012/base/partitioned/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solidModel linearGeometry;
solidModel linearGeometryTotalDisplacement;
//solidModel nonLinearGeometryUpdatedLagrangian;

"linearGeometryCoeffs|linearGeometryTotalDisplacementCoeffs|nonLinearGeometryUpdatedLagrangianCoeffs"
{
    solutionAlgorithm PETScSNES;

    // Predict displacement field at the start of a time step using the velocity
    //predictor               on;

    // Damp the solid to help convergence to steady-state
    dampingCoeff [0 0 -1 0 0 0 0] 1e4;
}

// ************************************************************************* //
